ConvNeXt(
  (features): Sequential(
    (0): Conv2dNormActivation(
      (0): Conv2d(3, 128, kernel_size=(4, 4), stride=(4, 4))
      (1): LayerNorm2d((128,), eps=1e-06, elementwise_affine=True)
    )
    (1): Sequential(
      (0): CNBlock(
        (block): Sequential(
          (0): Conv2d(128, 128, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=128)
          (1): Permute()
          (2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=128, out_features=512, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=512, out_features=128, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.0, mode=row)
      )
      (1): CNBlock(
        (block): Sequential(
          (0): Conv2d(128, 128, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=128)
          (1): Permute()
          (2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=128, out_features=512, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=512, out_features=128, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.014285714285714285, mode=row)
      )
      (2): CNBlock(
        (block): Sequential(
          (0): Conv2d(128, 128, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=128)
          (1): Permute()
          (2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=128, out_features=512, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=512, out_features=128, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.02857142857142857, mode=row)
      )
    )
    (2): Sequential(
      (0): LayerNorm2d((128,), eps=1e-06, elementwise_affine=True)
      (1): Conv2d(128, 256, kernel_size=(2, 2), stride=(2, 2))
    )
    (3): Sequential(
      (0): CNBlock(
        (block): Sequential(
          (0): Conv2d(256, 256, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=256)
          (1): Permute()
          (2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=256, out_features=1024, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=1024, out_features=256, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.04285714285714286, mode=row)
      )
      (1): CNBlock(
        (block): Sequential(
          (0): Conv2d(256, 256, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=256)
          (1): Permute()
          (2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=256, out_features=1024, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=1024, out_features=256, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.05714285714285714, mode=row)
      )
      (2): CNBlock(
        (block): Sequential(
          (0): Conv2d(256, 256, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=256)
          (1): Permute()
          (2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=256, out_features=1024, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=1024, out_features=256, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.07142857142857142, mode=row)
      )
    )
    (4): Sequential(
      (0): LayerNorm2d((256,), eps=1e-06, elementwise_affine=True)
      (1): Conv2d(256, 512, kernel_size=(2, 2), stride=(2, 2))
    )
    (5): Sequential(
      (0): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.08571428571428572, mode=row)
      )
      (1): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.1, mode=row)
      )
      (2): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.11428571428571428, mode=row)
      )
      (3): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.12857142857142856, mode=row)
      )
      (4): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.14285714285714285, mode=row)
      )
      (5): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.15714285714285714, mode=row)
      )
      (6): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.17142857142857143, mode=row)
      )
      (7): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.18571428571428572, mode=row)
      )
      (8): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.2, mode=row)
      )
      (9): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.21428571428571427, mode=row)
      )
      (10): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.22857142857142856, mode=row)
      )
      (11): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.24285714285714285, mode=row)
      )
      (12): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.2571428571428571, mode=row)
      )
      (13): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.2714285714285714, mode=row)
      )
      (14): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.2857142857142857, mode=row)
      )
      (15): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.3, mode=row)
      )
      (16): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.3142857142857143, mode=row)
      )
      (17): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.32857142857142857, mode=row)
      )
      (18): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.34285714285714286, mode=row)
      )
      (19): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.35714285714285715, mode=row)
      )
      (20): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.37142857142857144, mode=row)
      )
      (21): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.38571428571428573, mode=row)
      )
      (22): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.4, mode=row)
      )
      (23): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.4142857142857143, mode=row)
      )
      (24): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.42857142857142855, mode=row)
      )
      (25): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.44285714285714284, mode=row)
      )
      (26): CNBlock(
        (block): Sequential(
          (0): Conv2d(512, 512, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=512)
          (1): Permute()
          (2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=512, out_features=2048, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=2048, out_features=512, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.45714285714285713, mode=row)
      )
    )
    (6): Sequential(
      (0): LayerNorm2d((512,), eps=1e-06, elementwise_affine=True)
      (1): Conv2d(512, 1024, kernel_size=(2, 2), stride=(2, 2))
    )
    (7): Sequential(
      (0): CNBlock(
        (block): Sequential(
          (0): Conv2d(1024, 1024, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=1024)
          (1): Permute()
          (2): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=1024, out_features=4096, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=4096, out_features=1024, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.4714285714285714, mode=row)
      )
      (1): CNBlock(
        (block): Sequential(
          (0): Conv2d(1024, 1024, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=1024)
          (1): Permute()
          (2): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=1024, out_features=4096, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=4096, out_features=1024, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.4857142857142857, mode=row)
      )
      (2): CNBlock(
        (block): Sequential(
          (0): Conv2d(1024, 1024, kernel_size=(7, 7), stride=(1, 1), padding=(3, 3), groups=1024)
          (1): Permute()
          (2): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
          (3): Linear(in_features=1024, out_features=4096, bias=True)
          (4): GELU(approximate='none')
          (5): Linear(in_features=4096, out_features=1024, bias=True)
          (6): Permute()
        )
        (stochastic_depth): StochasticDepth(p=0.5, mode=row)
      )
    )
  )
  (avgpool): AdaptiveAvgPool2d(output_size=1)
  (classifier): Sequential(
    (0): LayerNorm2d((1024,), eps=1e-06, elementwise_affine=True)
    (1): Flatten(start_dim=1, end_dim=-1)
    (2): Linear(in_features=1024, out_features=1000, bias=True)
  )
)
