VGG16



        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
              ReLU-2         [-1, 64, 224, 224]               0
            Conv2d-3         [-1, 64, 224, 224]          36,928
              ReLU-4         [-1, 64, 224, 224]               0
         MaxPool2d-5         [-1, 64, 112, 112]               0
            Conv2d-6        [-1, 128, 112, 112]          73,856
              ReLU-7        [-1, 128, 112, 112]               0
            Conv2d-8        [-1, 128, 112, 112]         147,584
              ReLU-9        [-1, 128, 112, 112]               0
        MaxPool2d-10          [-1, 128, 56, 56]               0
           Conv2d-11          [-1, 256, 56, 56]         295,168
             ReLU-12          [-1, 256, 56, 56]               0
           Conv2d-13          [-1, 256, 56, 56]         590,080
             ReLU-14          [-1, 256, 56, 56]               0
           Conv2d-15          [-1, 256, 56, 56]         590,080
             ReLU-16          [-1, 256, 56, 56]               0
        MaxPool2d-17          [-1, 256, 28, 28]               0
           Conv2d-18          [-1, 512, 28, 28]       1,180,160
             ReLU-19          [-1, 512, 28, 28]               0
           Conv2d-20          [-1, 512, 28, 28]       2,359,808
             ReLU-21          [-1, 512, 28, 28]               0
           Conv2d-22          [-1, 512, 28, 28]       2,359,808
             ReLU-23          [-1, 512, 28, 28]               0
        MaxPool2d-24          [-1, 512, 14, 14]               0
           Conv2d-25          [-1, 512, 14, 14]       2,359,808
             ReLU-26          [-1, 512, 14, 14]               0
           Conv2d-27          [-1, 512, 14, 14]       2,359,808
             ReLU-28          [-1, 512, 14, 14]               0
           Conv2d-29          [-1, 512, 14, 14]       2,359,808
             ReLU-30          [-1, 512, 14, 14]               0
        MaxPool2d-31            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-32            [-1, 512, 7, 7]               0
           Linear-33                 [-1, 4096]     102,764,544
             ReLU-34                 [-1, 4096]               0
          Dropout-35                 [-1, 4096]               0
           Linear-36                 [-1, 4096]      16,781,312
             ReLU-37                 [-1, 4096]               0
          Dropout-38                 [-1, 4096]               0
           Linear-39                 [-1, 1000]       4,097,000
================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 218.78
Params size (MB): 527.79
Estimated Total Size (MB): 747.15




ResNet-18


        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
       BasicBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,864
      BatchNorm2d-13           [-1, 64, 56, 56]             128
             ReLU-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
       BasicBlock-18           [-1, 64, 56, 56]               0
           Conv2d-19          [-1, 128, 28, 28]          73,728
      BatchNorm2d-20          [-1, 128, 28, 28]             256
             ReLU-21          [-1, 128, 28, 28]               0
           Conv2d-22          [-1, 128, 28, 28]         147,456
      BatchNorm2d-23          [-1, 128, 28, 28]             256
           Conv2d-24          [-1, 128, 28, 28]           8,192
      BatchNorm2d-25          [-1, 128, 28, 28]             256
             ReLU-26          [-1, 128, 28, 28]               0
       BasicBlock-27          [-1, 128, 28, 28]               0
           Conv2d-28          [-1, 128, 28, 28]         147,456
      BatchNorm2d-29          [-1, 128, 28, 28]             256
             ReLU-30          [-1, 128, 28, 28]               0
           Conv2d-31          [-1, 128, 28, 28]         147,456
      BatchNorm2d-32          [-1, 128, 28, 28]             256
             ReLU-33          [-1, 128, 28, 28]               0
       BasicBlock-34          [-1, 128, 28, 28]               0
           Conv2d-35          [-1, 256, 14, 14]         294,912
      BatchNorm2d-36          [-1, 256, 14, 14]             512
             ReLU-37          [-1, 256, 14, 14]               0
           Conv2d-38          [-1, 256, 14, 14]         589,824
      BatchNorm2d-39          [-1, 256, 14, 14]             512
           Conv2d-40          [-1, 256, 14, 14]          32,768
      BatchNorm2d-41          [-1, 256, 14, 14]             512
             ReLU-42          [-1, 256, 14, 14]               0
       BasicBlock-43          [-1, 256, 14, 14]               0
           Conv2d-44          [-1, 256, 14, 14]         589,824
      BatchNorm2d-45          [-1, 256, 14, 14]             512
             ReLU-46          [-1, 256, 14, 14]               0
           Conv2d-47          [-1, 256, 14, 14]         589,824
      BatchNorm2d-48          [-1, 256, 14, 14]             512
             ReLU-49          [-1, 256, 14, 14]               0
       BasicBlock-50          [-1, 256, 14, 14]               0
           Conv2d-51            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-52            [-1, 512, 7, 7]           1,024
             ReLU-53            [-1, 512, 7, 7]               0
           Conv2d-54            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-55            [-1, 512, 7, 7]           1,024
           Conv2d-56            [-1, 512, 7, 7]         131,072
      BatchNorm2d-57            [-1, 512, 7, 7]           1,024
             ReLU-58            [-1, 512, 7, 7]               0
       BasicBlock-59            [-1, 512, 7, 7]               0
           Conv2d-60            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-61            [-1, 512, 7, 7]           1,024
             ReLU-62            [-1, 512, 7, 7]               0
           Conv2d-63            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-64            [-1, 512, 7, 7]           1,024
             ReLU-65            [-1, 512, 7, 7]               0
       BasicBlock-66            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-67            [-1, 512, 1, 1]               0
           Linear-68                 [-1, 1000]         513,000
================================================================
Total params: 11,689,512
Trainable params: 11,689,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 62.79
Params size (MB): 44.59
Estimated Total Size (MB): 107.96



ResNet-50


        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]           4,096
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
           Conv2d-11          [-1, 256, 56, 56]          16,384
      BatchNorm2d-12          [-1, 256, 56, 56]             512
           Conv2d-13          [-1, 256, 56, 56]          16,384
      BatchNorm2d-14          [-1, 256, 56, 56]             512
             ReLU-15          [-1, 256, 56, 56]               0
       Bottleneck-16          [-1, 256, 56, 56]               0
           Conv2d-17           [-1, 64, 56, 56]          16,384
      BatchNorm2d-18           [-1, 64, 56, 56]             128
             ReLU-19           [-1, 64, 56, 56]               0
           Conv2d-20           [-1, 64, 56, 56]          36,864
      BatchNorm2d-21           [-1, 64, 56, 56]             128
             ReLU-22           [-1, 64, 56, 56]               0
           Conv2d-23          [-1, 256, 56, 56]          16,384
      BatchNorm2d-24          [-1, 256, 56, 56]             512
             ReLU-25          [-1, 256, 56, 56]               0
       Bottleneck-26          [-1, 256, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]          16,384
      BatchNorm2d-28           [-1, 64, 56, 56]             128
             ReLU-29           [-1, 64, 56, 56]               0
           Conv2d-30           [-1, 64, 56, 56]          36,864
      BatchNorm2d-31           [-1, 64, 56, 56]             128
             ReLU-32           [-1, 64, 56, 56]               0
           Conv2d-33          [-1, 256, 56, 56]          16,384
      BatchNorm2d-34          [-1, 256, 56, 56]             512
             ReLU-35          [-1, 256, 56, 56]               0
       Bottleneck-36          [-1, 256, 56, 56]               0
           Conv2d-37          [-1, 128, 56, 56]          32,768
      BatchNorm2d-38          [-1, 128, 56, 56]             256
             ReLU-39          [-1, 128, 56, 56]               0
           Conv2d-40          [-1, 128, 28, 28]         147,456
      BatchNorm2d-41          [-1, 128, 28, 28]             256
             ReLU-42          [-1, 128, 28, 28]               0
           Conv2d-43          [-1, 512, 28, 28]          65,536
      BatchNorm2d-44          [-1, 512, 28, 28]           1,024
           Conv2d-45          [-1, 512, 28, 28]         131,072
      BatchNorm2d-46          [-1, 512, 28, 28]           1,024
             ReLU-47          [-1, 512, 28, 28]               0
       Bottleneck-48          [-1, 512, 28, 28]               0
           Conv2d-49          [-1, 128, 28, 28]          65,536
      BatchNorm2d-50          [-1, 128, 28, 28]             256
             ReLU-51          [-1, 128, 28, 28]               0
           Conv2d-52          [-1, 128, 28, 28]         147,456
      BatchNorm2d-53          [-1, 128, 28, 28]             256
             ReLU-54          [-1, 128, 28, 28]               0
           Conv2d-55          [-1, 512, 28, 28]          65,536
      BatchNorm2d-56          [-1, 512, 28, 28]           1,024
             ReLU-57          [-1, 512, 28, 28]               0
       Bottleneck-58          [-1, 512, 28, 28]               0
           Conv2d-59          [-1, 128, 28, 28]          65,536
      BatchNorm2d-60          [-1, 128, 28, 28]             256
             ReLU-61          [-1, 128, 28, 28]               0
           Conv2d-62          [-1, 128, 28, 28]         147,456
      BatchNorm2d-63          [-1, 128, 28, 28]             256
             ReLU-64          [-1, 128, 28, 28]               0
           Conv2d-65          [-1, 512, 28, 28]          65,536
      BatchNorm2d-66          [-1, 512, 28, 28]           1,024
             ReLU-67          [-1, 512, 28, 28]               0
       Bottleneck-68          [-1, 512, 28, 28]               0
           Conv2d-69          [-1, 128, 28, 28]          65,536
      BatchNorm2d-70          [-1, 128, 28, 28]             256
             ReLU-71          [-1, 128, 28, 28]               0
           Conv2d-72          [-1, 128, 28, 28]         147,456
      BatchNorm2d-73          [-1, 128, 28, 28]             256
             ReLU-74          [-1, 128, 28, 28]               0
           Conv2d-75          [-1, 512, 28, 28]          65,536
      BatchNorm2d-76          [-1, 512, 28, 28]           1,024
             ReLU-77          [-1, 512, 28, 28]               0
       Bottleneck-78          [-1, 512, 28, 28]               0
           Conv2d-79          [-1, 256, 28, 28]         131,072
      BatchNorm2d-80          [-1, 256, 28, 28]             512
             ReLU-81          [-1, 256, 28, 28]               0
           Conv2d-82          [-1, 256, 14, 14]         589,824
      BatchNorm2d-83          [-1, 256, 14, 14]             512
             ReLU-84          [-1, 256, 14, 14]               0
           Conv2d-85         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-86         [-1, 1024, 14, 14]           2,048
           Conv2d-87         [-1, 1024, 14, 14]         524,288
      BatchNorm2d-88         [-1, 1024, 14, 14]           2,048
             ReLU-89         [-1, 1024, 14, 14]               0
       Bottleneck-90         [-1, 1024, 14, 14]               0
           Conv2d-91          [-1, 256, 14, 14]         262,144
      BatchNorm2d-92          [-1, 256, 14, 14]             512
             ReLU-93          [-1, 256, 14, 14]               0
           Conv2d-94          [-1, 256, 14, 14]         589,824
      BatchNorm2d-95          [-1, 256, 14, 14]             512
             ReLU-96          [-1, 256, 14, 14]               0
           Conv2d-97         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-98         [-1, 1024, 14, 14]           2,048
             ReLU-99         [-1, 1024, 14, 14]               0
      Bottleneck-100         [-1, 1024, 14, 14]               0
          Conv2d-101          [-1, 256, 14, 14]         262,144
     BatchNorm2d-102          [-1, 256, 14, 14]             512
            ReLU-103          [-1, 256, 14, 14]               0
          Conv2d-104          [-1, 256, 14, 14]         589,824
     BatchNorm2d-105          [-1, 256, 14, 14]             512
            ReLU-106          [-1, 256, 14, 14]               0
          Conv2d-107         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-108         [-1, 1024, 14, 14]           2,048
            ReLU-109         [-1, 1024, 14, 14]               0
      Bottleneck-110         [-1, 1024, 14, 14]               0
          Conv2d-111          [-1, 256, 14, 14]         262,144
     BatchNorm2d-112          [-1, 256, 14, 14]             512
            ReLU-113          [-1, 256, 14, 14]               0
          Conv2d-114          [-1, 256, 14, 14]         589,824
     BatchNorm2d-115          [-1, 256, 14, 14]             512
            ReLU-116          [-1, 256, 14, 14]               0
          Conv2d-117         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-118         [-1, 1024, 14, 14]           2,048
            ReLU-119         [-1, 1024, 14, 14]               0
      Bottleneck-120         [-1, 1024, 14, 14]               0
          Conv2d-121          [-1, 256, 14, 14]         262,144
     BatchNorm2d-122          [-1, 256, 14, 14]             512
            ReLU-123          [-1, 256, 14, 14]               0
          Conv2d-124          [-1, 256, 14, 14]         589,824
     BatchNorm2d-125          [-1, 256, 14, 14]             512
            ReLU-126          [-1, 256, 14, 14]               0
          Conv2d-127         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-128         [-1, 1024, 14, 14]           2,048
            ReLU-129         [-1, 1024, 14, 14]               0
      Bottleneck-130         [-1, 1024, 14, 14]               0
          Conv2d-131          [-1, 256, 14, 14]         262,144
     BatchNorm2d-132          [-1, 256, 14, 14]             512
            ReLU-133          [-1, 256, 14, 14]               0
          Conv2d-134          [-1, 256, 14, 14]         589,824
     BatchNorm2d-135          [-1, 256, 14, 14]             512
            ReLU-136          [-1, 256, 14, 14]               0
          Conv2d-137         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-138         [-1, 1024, 14, 14]           2,048
            ReLU-139         [-1, 1024, 14, 14]               0
      Bottleneck-140         [-1, 1024, 14, 14]               0
          Conv2d-141          [-1, 512, 14, 14]         524,288
     BatchNorm2d-142          [-1, 512, 14, 14]           1,024
            ReLU-143          [-1, 512, 14, 14]               0
          Conv2d-144            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-145            [-1, 512, 7, 7]           1,024
            ReLU-146            [-1, 512, 7, 7]               0
          Conv2d-147           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-148           [-1, 2048, 7, 7]           4,096
          Conv2d-149           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-150           [-1, 2048, 7, 7]           4,096
            ReLU-151           [-1, 2048, 7, 7]               0
      Bottleneck-152           [-1, 2048, 7, 7]               0
          Conv2d-153            [-1, 512, 7, 7]       1,048,576
     BatchNorm2d-154            [-1, 512, 7, 7]           1,024
            ReLU-155            [-1, 512, 7, 7]               0
          Conv2d-156            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-157            [-1, 512, 7, 7]           1,024
            ReLU-158            [-1, 512, 7, 7]               0
          Conv2d-159           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-160           [-1, 2048, 7, 7]           4,096
            ReLU-161           [-1, 2048, 7, 7]               0
      Bottleneck-162           [-1, 2048, 7, 7]               0
          Conv2d-163            [-1, 512, 7, 7]       1,048,576
     BatchNorm2d-164            [-1, 512, 7, 7]           1,024
            ReLU-165            [-1, 512, 7, 7]               0
          Conv2d-166            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-167            [-1, 512, 7, 7]           1,024
            ReLU-168            [-1, 512, 7, 7]               0
          Conv2d-169           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-170           [-1, 2048, 7, 7]           4,096
            ReLU-171           [-1, 2048, 7, 7]               0
      Bottleneck-172           [-1, 2048, 7, 7]               0
AdaptiveAvgPool2d-173           [-1, 2048, 1, 1]               0
          Linear-174                 [-1, 1000]       2,049,000
================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 286.56
Params size (MB): 97.49
Estimated Total Size (MB): 384.62



ConvNext


----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 128, 56, 56]           6,272
       LayerNorm2d-2          [-1, 128, 56, 56]             256
            Conv2d-3          [-1, 128, 56, 56]           6,400
           Permute-4          [-1, 56, 56, 128]               0
         LayerNorm-5          [-1, 56, 56, 128]             256
            Linear-6          [-1, 56, 56, 512]          66,048
              GELU-7          [-1, 56, 56, 512]               0
            Linear-8          [-1, 56, 56, 128]          65,664
           Permute-9          [-1, 128, 56, 56]               0
  StochasticDepth-10          [-1, 128, 56, 56]               0
          CNBlock-11          [-1, 128, 56, 56]               0
           Conv2d-12          [-1, 128, 56, 56]           6,400
          Permute-13          [-1, 56, 56, 128]               0
        LayerNorm-14          [-1, 56, 56, 128]             256
           Linear-15          [-1, 56, 56, 512]          66,048
             GELU-16          [-1, 56, 56, 512]               0
           Linear-17          [-1, 56, 56, 128]          65,664
          Permute-18          [-1, 128, 56, 56]               0
  StochasticDepth-19          [-1, 128, 56, 56]               0
          CNBlock-20          [-1, 128, 56, 56]               0
           Conv2d-21          [-1, 128, 56, 56]           6,400
          Permute-22          [-1, 56, 56, 128]               0
        LayerNorm-23          [-1, 56, 56, 128]             256
           Linear-24          [-1, 56, 56, 512]          66,048
             GELU-25          [-1, 56, 56, 512]               0
           Linear-26          [-1, 56, 56, 128]          65,664
          Permute-27          [-1, 128, 56, 56]               0
  StochasticDepth-28          [-1, 128, 56, 56]               0
          CNBlock-29          [-1, 128, 56, 56]               0
      LayerNorm2d-30          [-1, 128, 56, 56]             256
           Conv2d-31          [-1, 256, 28, 28]         131,328
           Conv2d-32          [-1, 256, 28, 28]          12,800
          Permute-33          [-1, 28, 28, 256]               0
        LayerNorm-34          [-1, 28, 28, 256]             512
           Linear-35         [-1, 28, 28, 1024]         263,168
             GELU-36         [-1, 28, 28, 1024]               0
           Linear-37          [-1, 28, 28, 256]         262,400
          Permute-38          [-1, 256, 28, 28]               0
  StochasticDepth-39          [-1, 256, 28, 28]               0
          CNBlock-40          [-1, 256, 28, 28]               0
           Conv2d-41          [-1, 256, 28, 28]          12,800
          Permute-42          [-1, 28, 28, 256]               0
        LayerNorm-43          [-1, 28, 28, 256]             512
           Linear-44         [-1, 28, 28, 1024]         263,168
             GELU-45         [-1, 28, 28, 1024]               0
           Linear-46          [-1, 28, 28, 256]         262,400
          Permute-47          [-1, 256, 28, 28]               0
  StochasticDepth-48          [-1, 256, 28, 28]               0
          CNBlock-49          [-1, 256, 28, 28]               0
           Conv2d-50          [-1, 256, 28, 28]          12,800
          Permute-51          [-1, 28, 28, 256]               0
        LayerNorm-52          [-1, 28, 28, 256]             512
           Linear-53         [-1, 28, 28, 1024]         263,168
             GELU-54         [-1, 28, 28, 1024]               0
           Linear-55          [-1, 28, 28, 256]         262,400
          Permute-56          [-1, 256, 28, 28]               0
  StochasticDepth-57          [-1, 256, 28, 28]               0
          CNBlock-58          [-1, 256, 28, 28]               0
      LayerNorm2d-59          [-1, 256, 28, 28]             512
           Conv2d-60          [-1, 512, 14, 14]         524,800
           Conv2d-61          [-1, 512, 14, 14]          25,600
          Permute-62          [-1, 14, 14, 512]               0
        LayerNorm-63          [-1, 14, 14, 512]           1,024
           Linear-64         [-1, 14, 14, 2048]       1,050,624
             GELU-65         [-1, 14, 14, 2048]               0
           Linear-66          [-1, 14, 14, 512]       1,049,088
          Permute-67          [-1, 512, 14, 14]               0
  StochasticDepth-68          [-1, 512, 14, 14]               0
          CNBlock-69          [-1, 512, 14, 14]               0
           Conv2d-70          [-1, 512, 14, 14]          25,600
          Permute-71          [-1, 14, 14, 512]               0
        LayerNorm-72          [-1, 14, 14, 512]           1,024
           Linear-73         [-1, 14, 14, 2048]       1,050,624
             GELU-74         [-1, 14, 14, 2048]               0
           Linear-75          [-1, 14, 14, 512]       1,049,088
          Permute-76          [-1, 512, 14, 14]               0
  StochasticDepth-77          [-1, 512, 14, 14]               0
          CNBlock-78          [-1, 512, 14, 14]               0
           Conv2d-79          [-1, 512, 14, 14]          25,600
          Permute-80          [-1, 14, 14, 512]               0
        LayerNorm-81          [-1, 14, 14, 512]           1,024
           Linear-82         [-1, 14, 14, 2048]       1,050,624
             GELU-83         [-1, 14, 14, 2048]               0
           Linear-84          [-1, 14, 14, 512]       1,049,088
          Permute-85          [-1, 512, 14, 14]               0
  StochasticDepth-86          [-1, 512, 14, 14]               0
          CNBlock-87          [-1, 512, 14, 14]               0
           Conv2d-88          [-1, 512, 14, 14]          25,600
          Permute-89          [-1, 14, 14, 512]               0
        LayerNorm-90          [-1, 14, 14, 512]           1,024
           Linear-91         [-1, 14, 14, 2048]       1,050,624
             GELU-92         [-1, 14, 14, 2048]               0
           Linear-93          [-1, 14, 14, 512]       1,049,088
          Permute-94          [-1, 512, 14, 14]               0
  StochasticDepth-95          [-1, 512, 14, 14]               0
          CNBlock-96          [-1, 512, 14, 14]               0
           Conv2d-97          [-1, 512, 14, 14]          25,600
          Permute-98          [-1, 14, 14, 512]               0
        LayerNorm-99          [-1, 14, 14, 512]           1,024
          Linear-100         [-1, 14, 14, 2048]       1,050,624
            GELU-101         [-1, 14, 14, 2048]               0
          Linear-102          [-1, 14, 14, 512]       1,049,088
         Permute-103          [-1, 512, 14, 14]               0
 StochasticDepth-104          [-1, 512, 14, 14]               0
         CNBlock-105          [-1, 512, 14, 14]               0
          Conv2d-106          [-1, 512, 14, 14]          25,600
         Permute-107          [-1, 14, 14, 512]               0
       LayerNorm-108          [-1, 14, 14, 512]           1,024
          Linear-109         [-1, 14, 14, 2048]       1,050,624
            GELU-110         [-1, 14, 14, 2048]               0
          Linear-111          [-1, 14, 14, 512]       1,049,088
         Permute-112          [-1, 512, 14, 14]               0
 StochasticDepth-113          [-1, 512, 14, 14]               0
         CNBlock-114          [-1, 512, 14, 14]               0
          Conv2d-115          [-1, 512, 14, 14]          25,600
         Permute-116          [-1, 14, 14, 512]               0
       LayerNorm-117          [-1, 14, 14, 512]           1,024
          Linear-118         [-1, 14, 14, 2048]       1,050,624
            GELU-119         [-1, 14, 14, 2048]               0
          Linear-120          [-1, 14, 14, 512]       1,049,088
         Permute-121          [-1, 512, 14, 14]               0
 StochasticDepth-122          [-1, 512, 14, 14]               0
         CNBlock-123          [-1, 512, 14, 14]               0
          Conv2d-124          [-1, 512, 14, 14]          25,600
         Permute-125          [-1, 14, 14, 512]               0
       LayerNorm-126          [-1, 14, 14, 512]           1,024
          Linear-127         [-1, 14, 14, 2048]       1,050,624
            GELU-128         [-1, 14, 14, 2048]               0
          Linear-129          [-1, 14, 14, 512]       1,049,088
         Permute-130          [-1, 512, 14, 14]               0
 StochasticDepth-131          [-1, 512, 14, 14]               0
         CNBlock-132          [-1, 512, 14, 14]               0
          Conv2d-133          [-1, 512, 14, 14]          25,600
         Permute-134          [-1, 14, 14, 512]               0
       LayerNorm-135          [-1, 14, 14, 512]           1,024
          Linear-136         [-1, 14, 14, 2048]       1,050,624
            GELU-137         [-1, 14, 14, 2048]               0
          Linear-138          [-1, 14, 14, 512]       1,049,088
         Permute-139          [-1, 512, 14, 14]               0
 StochasticDepth-140          [-1, 512, 14, 14]               0
         CNBlock-141          [-1, 512, 14, 14]               0
          Conv2d-142          [-1, 512, 14, 14]          25,600
         Permute-143          [-1, 14, 14, 512]               0
       LayerNorm-144          [-1, 14, 14, 512]           1,024
          Linear-145         [-1, 14, 14, 2048]       1,050,624
            GELU-146         [-1, 14, 14, 2048]               0
          Linear-147          [-1, 14, 14, 512]       1,049,088
         Permute-148          [-1, 512, 14, 14]               0
 StochasticDepth-149          [-1, 512, 14, 14]               0
         CNBlock-150          [-1, 512, 14, 14]               0
          Conv2d-151          [-1, 512, 14, 14]          25,600
         Permute-152          [-1, 14, 14, 512]               0
       LayerNorm-153          [-1, 14, 14, 512]           1,024
          Linear-154         [-1, 14, 14, 2048]       1,050,624
            GELU-155         [-1, 14, 14, 2048]               0
          Linear-156          [-1, 14, 14, 512]       1,049,088
         Permute-157          [-1, 512, 14, 14]               0
 StochasticDepth-158          [-1, 512, 14, 14]               0
         CNBlock-159          [-1, 512, 14, 14]               0
          Conv2d-160          [-1, 512, 14, 14]          25,600
         Permute-161          [-1, 14, 14, 512]               0
       LayerNorm-162          [-1, 14, 14, 512]           1,024
          Linear-163         [-1, 14, 14, 2048]       1,050,624
            GELU-164         [-1, 14, 14, 2048]               0
          Linear-165          [-1, 14, 14, 512]       1,049,088
         Permute-166          [-1, 512, 14, 14]               0
 StochasticDepth-167          [-1, 512, 14, 14]               0
         CNBlock-168          [-1, 512, 14, 14]               0
          Conv2d-169          [-1, 512, 14, 14]          25,600
         Permute-170          [-1, 14, 14, 512]               0
       LayerNorm-171          [-1, 14, 14, 512]           1,024
          Linear-172         [-1, 14, 14, 2048]       1,050,624
            GELU-173         [-1, 14, 14, 2048]               0
          Linear-174          [-1, 14, 14, 512]       1,049,088
         Permute-175          [-1, 512, 14, 14]               0
 StochasticDepth-176          [-1, 512, 14, 14]               0
         CNBlock-177          [-1, 512, 14, 14]               0
          Conv2d-178          [-1, 512, 14, 14]          25,600
         Permute-179          [-1, 14, 14, 512]               0
       LayerNorm-180          [-1, 14, 14, 512]           1,024
          Linear-181         [-1, 14, 14, 2048]       1,050,624
            GELU-182         [-1, 14, 14, 2048]               0
          Linear-183          [-1, 14, 14, 512]       1,049,088
         Permute-184          [-1, 512, 14, 14]               0
 StochasticDepth-185          [-1, 512, 14, 14]               0
         CNBlock-186          [-1, 512, 14, 14]               0
          Conv2d-187          [-1, 512, 14, 14]          25,600
         Permute-188          [-1, 14, 14, 512]               0
       LayerNorm-189          [-1, 14, 14, 512]           1,024
          Linear-190         [-1, 14, 14, 2048]       1,050,624
            GELU-191         [-1, 14, 14, 2048]               0
          Linear-192          [-1, 14, 14, 512]       1,049,088
         Permute-193          [-1, 512, 14, 14]               0
 StochasticDepth-194          [-1, 512, 14, 14]               0
         CNBlock-195          [-1, 512, 14, 14]               0
          Conv2d-196          [-1, 512, 14, 14]          25,600
         Permute-197          [-1, 14, 14, 512]               0
       LayerNorm-198          [-1, 14, 14, 512]           1,024
          Linear-199         [-1, 14, 14, 2048]       1,050,624
            GELU-200         [-1, 14, 14, 2048]               0
          Linear-201          [-1, 14, 14, 512]       1,049,088
         Permute-202          [-1, 512, 14, 14]               0
 StochasticDepth-203          [-1, 512, 14, 14]               0
         CNBlock-204          [-1, 512, 14, 14]               0
          Conv2d-205          [-1, 512, 14, 14]          25,600
         Permute-206          [-1, 14, 14, 512]               0
       LayerNorm-207          [-1, 14, 14, 512]           1,024
          Linear-208         [-1, 14, 14, 2048]       1,050,624
            GELU-209         [-1, 14, 14, 2048]               0
          Linear-210          [-1, 14, 14, 512]       1,049,088
         Permute-211          [-1, 512, 14, 14]               0
 StochasticDepth-212          [-1, 512, 14, 14]               0
         CNBlock-213          [-1, 512, 14, 14]               0
          Conv2d-214          [-1, 512, 14, 14]          25,600
         Permute-215          [-1, 14, 14, 512]               0
       LayerNorm-216          [-1, 14, 14, 512]           1,024
          Linear-217         [-1, 14, 14, 2048]       1,050,624
            GELU-218         [-1, 14, 14, 2048]               0
          Linear-219          [-1, 14, 14, 512]       1,049,088
         Permute-220          [-1, 512, 14, 14]               0
 StochasticDepth-221          [-1, 512, 14, 14]               0
         CNBlock-222          [-1, 512, 14, 14]               0
          Conv2d-223          [-1, 512, 14, 14]          25,600
         Permute-224          [-1, 14, 14, 512]               0
       LayerNorm-225          [-1, 14, 14, 512]           1,024
          Linear-226         [-1, 14, 14, 2048]       1,050,624
            GELU-227         [-1, 14, 14, 2048]               0
          Linear-228          [-1, 14, 14, 512]       1,049,088
         Permute-229          [-1, 512, 14, 14]               0
 StochasticDepth-230          [-1, 512, 14, 14]               0
         CNBlock-231          [-1, 512, 14, 14]               0
          Conv2d-232          [-1, 512, 14, 14]          25,600
         Permute-233          [-1, 14, 14, 512]               0
       LayerNorm-234          [-1, 14, 14, 512]           1,024
          Linear-235         [-1, 14, 14, 2048]       1,050,624
            GELU-236         [-1, 14, 14, 2048]               0
          Linear-237          [-1, 14, 14, 512]       1,049,088
         Permute-238          [-1, 512, 14, 14]               0
 StochasticDepth-239          [-1, 512, 14, 14]               0
         CNBlock-240          [-1, 512, 14, 14]               0
          Conv2d-241          [-1, 512, 14, 14]          25,600
         Permute-242          [-1, 14, 14, 512]               0
       LayerNorm-243          [-1, 14, 14, 512]           1,024
          Linear-244         [-1, 14, 14, 2048]       1,050,624
            GELU-245         [-1, 14, 14, 2048]               0
          Linear-246          [-1, 14, 14, 512]       1,049,088
         Permute-247          [-1, 512, 14, 14]               0
 StochasticDepth-248          [-1, 512, 14, 14]               0
         CNBlock-249          [-1, 512, 14, 14]               0
          Conv2d-250          [-1, 512, 14, 14]          25,600
         Permute-251          [-1, 14, 14, 512]               0
       LayerNorm-252          [-1, 14, 14, 512]           1,024
          Linear-253         [-1, 14, 14, 2048]       1,050,624
            GELU-254         [-1, 14, 14, 2048]               0
          Linear-255          [-1, 14, 14, 512]       1,049,088
         Permute-256          [-1, 512, 14, 14]               0
 StochasticDepth-257          [-1, 512, 14, 14]               0
         CNBlock-258          [-1, 512, 14, 14]               0
          Conv2d-259          [-1, 512, 14, 14]          25,600
         Permute-260          [-1, 14, 14, 512]               0
       LayerNorm-261          [-1, 14, 14, 512]           1,024
          Linear-262         [-1, 14, 14, 2048]       1,050,624
            GELU-263         [-1, 14, 14, 2048]               0
          Linear-264          [-1, 14, 14, 512]       1,049,088
         Permute-265          [-1, 512, 14, 14]               0
 StochasticDepth-266          [-1, 512, 14, 14]               0
         CNBlock-267          [-1, 512, 14, 14]               0
          Conv2d-268          [-1, 512, 14, 14]          25,600
         Permute-269          [-1, 14, 14, 512]               0
       LayerNorm-270          [-1, 14, 14, 512]           1,024
          Linear-271         [-1, 14, 14, 2048]       1,050,624
            GELU-272         [-1, 14, 14, 2048]               0
          Linear-273          [-1, 14, 14, 512]       1,049,088
         Permute-274          [-1, 512, 14, 14]               0
 StochasticDepth-275          [-1, 512, 14, 14]               0
         CNBlock-276          [-1, 512, 14, 14]               0
          Conv2d-277          [-1, 512, 14, 14]          25,600
         Permute-278          [-1, 14, 14, 512]               0
       LayerNorm-279          [-1, 14, 14, 512]           1,024
          Linear-280         [-1, 14, 14, 2048]       1,050,624
            GELU-281         [-1, 14, 14, 2048]               0
          Linear-282          [-1, 14, 14, 512]       1,049,088
         Permute-283          [-1, 512, 14, 14]               0
 StochasticDepth-284          [-1, 512, 14, 14]               0
         CNBlock-285          [-1, 512, 14, 14]               0
          Conv2d-286          [-1, 512, 14, 14]          25,600
         Permute-287          [-1, 14, 14, 512]               0
       LayerNorm-288          [-1, 14, 14, 512]           1,024
          Linear-289         [-1, 14, 14, 2048]       1,050,624
            GELU-290         [-1, 14, 14, 2048]               0
          Linear-291          [-1, 14, 14, 512]       1,049,088
         Permute-292          [-1, 512, 14, 14]               0
 StochasticDepth-293          [-1, 512, 14, 14]               0
         CNBlock-294          [-1, 512, 14, 14]               0
          Conv2d-295          [-1, 512, 14, 14]          25,600
         Permute-296          [-1, 14, 14, 512]               0
       LayerNorm-297          [-1, 14, 14, 512]           1,024
          Linear-298         [-1, 14, 14, 2048]       1,050,624
            GELU-299         [-1, 14, 14, 2048]               0
          Linear-300          [-1, 14, 14, 512]       1,049,088
         Permute-301          [-1, 512, 14, 14]               0
 StochasticDepth-302          [-1, 512, 14, 14]               0
         CNBlock-303          [-1, 512, 14, 14]               0
     LayerNorm2d-304          [-1, 512, 14, 14]           1,024
          Conv2d-305           [-1, 1024, 7, 7]       2,098,176
          Conv2d-306           [-1, 1024, 7, 7]          51,200
         Permute-307           [-1, 7, 7, 1024]               0
       LayerNorm-308           [-1, 7, 7, 1024]           2,048
          Linear-309           [-1, 7, 7, 4096]       4,198,400
            GELU-310           [-1, 7, 7, 4096]               0
          Linear-311           [-1, 7, 7, 1024]       4,195,328
         Permute-312           [-1, 1024, 7, 7]               0
 StochasticDepth-313           [-1, 1024, 7, 7]               0
         CNBlock-314           [-1, 1024, 7, 7]               0
          Conv2d-315           [-1, 1024, 7, 7]          51,200
         Permute-316           [-1, 7, 7, 1024]               0
       LayerNorm-317           [-1, 7, 7, 1024]           2,048
          Linear-318           [-1, 7, 7, 4096]       4,198,400
            GELU-319           [-1, 7, 7, 4096]               0
          Linear-320           [-1, 7, 7, 1024]       4,195,328
         Permute-321           [-1, 1024, 7, 7]               0
 StochasticDepth-322           [-1, 1024, 7, 7]               0
         CNBlock-323           [-1, 1024, 7, 7]               0
          Conv2d-324           [-1, 1024, 7, 7]          51,200
         Permute-325           [-1, 7, 7, 1024]               0
       LayerNorm-326           [-1, 7, 7, 1024]           2,048
          Linear-327           [-1, 7, 7, 4096]       4,198,400
            GELU-328           [-1, 7, 7, 4096]               0
          Linear-329           [-1, 7, 7, 1024]       4,195,328
         Permute-330           [-1, 1024, 7, 7]               0
 StochasticDepth-331           [-1, 1024, 7, 7]               0
         CNBlock-332           [-1, 1024, 7, 7]               0
AdaptiveAvgPool2d-333           [-1, 1024, 1, 1]               0
     LayerNorm2d-334           [-1, 1024, 1, 1]           2,048
         Flatten-335                 [-1, 1024]               0
          Linear-336                 [-1, 1000]       1,025,000
================================================================
Total params: 88,573,416
Trainable params: 88,573,416
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 548.22
Params size (MB): 337.88
Estimated Total Size (MB): 886.67









